[
  {
    "Id": 1,
    "Title": "US Citizenship Test",
    "Summary": "The U.S. Citizenship and Immigration Services provides us with 100 questions and answers that cover American Government, History, and Civics. The test is an oral test and the applicant will be asked 10 questions (taken from the 100 provided) from which at least 6 must be answered correctly in order to pass the test.",
    "Post": "<p>A few weeks ago I was visiting with a family member that is studying to take the US Citizenship test and decided to help by creating a web application that can be used to study online.  Since the application is hosted on the Internet anyone can practice the questions and answers by going to the <a href='http://SouthToNorth.com' target='_blank'>SouthToNorth.com</a> website using a computer, a tablet, or a phone.</p><p>The U.S. Citizenship and Immigration Services provides us with 100 questions and answers that cover American Government, History, and Civics. The test is an oral test and the applicant will be asked 10 questions (taken from the 100 provided) from which at least 6 must be answered correctly in order to pass the test.</p><p> Maybe you know someone that is studying to take the test; if so, then send her/him the website link. I can tell you that I took the test and failed in more than one answer.  Go ahead and see how much you “really” know about U.S. history and government. </p><p>Enjoy,</p>",
    "Type": "Personal",
    "Date": "February 9 2015",
    "ImageURL": "./images/1.png"
  },
  {
    "Id": 2,
    "Title": "MS Band is not a Fashion Statement",
    "Summary": "It’s a technological statement.  I’ve been wearing the MS Band for twelve days now and I’m impressed with how much technology is packed into this single health band: built-in GPS, UV monitor, optical heart rate sensor, 3-axis accelerometer, gyrometer, ambient light sensor, skin temperature sensor, capacitive sensor, galvanic skin response, microphone, haptic vibration motor, Bluetooth, touch-enabled TFT full-color display, etc.",
    "Post": "<p>It’s a technological statement.  I’ve been wearing the MS Band for twelve days now and I’m impressed with how much technology is packed into this single health band: built-in GPS, UV monitor, optical heart rate sensor, 3-axis accelerometer, gyrometer, ambient light sensor, skin temperature sensor, capacitive sensor, galvanic skin response, microphone, haptic vibration motor, Bluetooth, touch-enabled TFT full-color display, etc., etc.; and, this my friends is only the hardware.  The software will blow your mind.</p><p>I use it every day to monitor my sleep, my heart rate, my exercise routines, the amount of calories I burn, my messages and my calendar reminders among many other things. The MS Band connects to my Lumia 925 Windows 8.1 phone via Bluetooth, and syncs with my Microsoft Health application providing me with plenty more information regarding my daily activities.  The phone app also manages my Band settings giving me options to customize the look, and allows me to add or delete notification tiles. And, oh yeah before I forget: the MS Band also syncs with Android and Apple phones.</p><p>There are plenty of reviews, pictures, and videos online that you can watch if you’re interested in finding out more.  Here is a link to a video that I like: Microsoft Band hands-on. If you want to read online reviews you will find that most of them will score the Band four-out-of-five stars. Here are a couple of reviewers that were not very impressed: <br/><br/>Microsoft Band: Killer on the inside, 'meh' on the outside<br/>Microsoft Band Review: Tracks Your Every Move, Then Breaks Your Heart</p><p>Is the MS Band perfect? No.  Can it be improved? Yes, and I’m sure that it will be. In my book it certainly deserves a five star rating.  Interested?  Find out more here: <a href='http://www.microsoft.com/microsoft-band/en-us' target='_blank'>microsoft-band</a> and here: <a href='http://www.microsoft.com/microsoft-band/en-us/get-started' target='_blank'>microsoft-band get-started</a>.</p><p>Time to monitor my sleep…</p>",
    "Type": "Hardware",
    "Date": "November 15 2014",
    "ImageURL": "./images/2.png"
  },
  {
    "Id": 3,
    "Title": "Calling Web API with AngularJS",
    "Summary": "Been working with Web API for the entire week and decided to use angular as a test to see how hard/easy it would be to access the API from within an HTML page hosted on a different server.  Now, I’m new to AngularJS and also new to Web API so things do not come naturally to me.  Fortunately there is plenty of help online in the form of documentation, user groups, videos, etc.",
    "Post": "<p>Been working with Web API for the entire week and decided to use angular as a test to see how hard/easy it would be to access the API from within an HTML page hosted on a different server.  Now, I’m new to AngularJS and also new to Web API so things do not come naturally to me.  Fortunately there is plenty of help online in the form of documentation, user groups, videos, etc.</p><p>At the end it turned out to be easier than expected, and like everything else I’ve done with AngularJS I was blown away by the simplicity.  The Angular code that did the trick was the following:</p><blockquote><p>(function () {<br>'use strict';<br>var app = angular.module('app', []);<br>var MainController = function($scope, $http) {<br>        $scope.message = 'Testing Web API with AngularJS';<br>        $scope.simpleTest = function () {<br>getResults('<a href='https://web.archive.org/web/20160316164820/http://website/api/results%22);'>http://website/api/results');</a><br>        };<br>var onSuccess = function (response) {<br>            $scope.results = response.data;<br>        };<br>var onError = function (reason) {<br>            $scope.error = 'Could not fetch the results';<br>        };<br>var getResults = function (url) {<br>            $http.get(url)<br>            .then(onSuccess, onError);<br>        }<br>    };<br>app.controller('MainController', ['$scope', '$http', MainController]);<br>})();</p></blockquote><p>Where I would call the getResults() function using a ng-click directive.  I wish I could take credit for the code but like everything else that I do when learning something new: I copied it from a sample in http://plnkr.co</p><p>Learning something new is always fun…</p>",
    "Type": "Software Development",
    "Date": "September 16 2014",
    "ImageURL": "./images/3.png"
  },
  {
    "Id": 4,
    "Title": "Support Your Own",
    "Summary": "With this short post I want to encourage all of you to support a family member. If and when you need someone to work on your car or your home. Or, if you need to see a dentist, a doctor, or need financial advice, find out if there’s a member of your family that provides that service first.",
    "Post": "<p>When I need work done that requires a handyman who do I call? I call Roberto Gaxiola <a href='http://handyman.gaxiola.info' target='_blank'>http://handyman.gaxiola.info</a>. If I need help with real estate – buying or selling – I get in contact with Samuel Gaxiola <a href='http://samuelgaxiola.com' target='_blank'>http://samuelgaxiola.com</a>. For legal issues I can’t think of a better person than Fernando X. Gaxiola <a href='http://tucsonlawoffice.com' target='_blank'>http://tucsonlawoffice.com</a>. Why? Because they’re family and they’re the best in town.</p><p>What do I do when one of them is not available? I ask for a recommendation from one of them or some other family member; because I believe in supporting my own – and you should too. The concept is not new and there are plenty of examples: churches, clubs, and ethnic groups. Some by mandate, others by tradition. Whatever the reason the result is the same: support your own.</p><p>With this short post I want to encourage all of you to do the same. If and when you need someone to work on your car or your home. Or, if you need to see a dentist, a doctor, or need financial advice, find out if there’s a member of your family that provides that service first.</p><p>I did a quick online search and created a small list of those family members that provide services or own businesses. Check them out here:</p><p><a href='http://gaxiola.info' target='_blank'>http://gaxiola.info</a> in the Negocios section</p><p>I’m sure that there are plenty of family owned businesses and services in your area. Call them first and recommend them when you have a chance.</p><p>Just a thought….</p>",
    "Type": "Personal",
    "Date": "October 7 2014",
    "ImageURL": "./images/4.png"
  },
  {
    "Id": 5,
    "Title": "Pocket OCR Scanner",
    "Summary": "Take a picture of a text document and with a few additional steps save it to OneDrive as a Word document. How cool is that? Microsoft just upgraded my free Office Lens Windows Phone App and it does exactly that plus more.",
    "Post": "<p>Take a picture of a text document and with a few additional steps save it to OneDrive as a Word document. How cool is that? Microsoft just upgraded my free Office Lens Windows Phone App and it does exactly that plus more.</p><p>Recently I have been involved in a project of publishing a book that is currently in print form to the web. The process involved in creating the web page is: Scan the document, convert it to PDF format, open the document with a PDF reader, copy sections of text from the PDF document into a Word document, then proof the document, format, save as text, and copy the text to an HTML page. With Office Lens I no longer need the scanner, and I don’t have to copy and paste to Word; now I just take a picture and save it as a Word document. I still need to do the proofing, formatting, and HTML but the fact that I don’t need a scanner is worth plenty – at least to me.</p><p>Saving your pictures to Word document is only one of the features. Office Lens will also save your pictures as OneNote documents, and diagrams can be saved as PowerPoint files. I now have an OCR scanner in my pocket. If you don’t have Office Lens installed on your phone go ahead and get it now – it’s free – from this website: Office Lens App for Windows Phone</p><p>I haven’t tried the PowerPoint option but the OneNote and Word capabilities work surprisingly well. I give it five stars.</p><p>Enjoy,</p>",
    "Type": "Technical",
    "Date": "September 17 2014",
    "ImageURL": "./images/5.png"
  },
  {
    "Id": 6,
    "Title": "Another Work in Progress",
    "Summary": "A long time ago – more than 30 years – I came across a small book written by a family member:  “Mi Tio Maclovio” by J. Felipe Gaxiola.  The book is a biography of Maclovio Gaxiola Lopez who was my grandfather’s brother and a great man that inspired many and whose legacy lives.",
    "Post": "<p>A long time ago – more than 30 years – I came across a small book written by a family member:  “Mi Tio Maclovio” by J. Felipe Gaxiola.  The book is a biography of Maclovio Gaxiola Lopez who was my grandfather’s brother and a great man that inspired many and whose legacy lives.</p><p>Reading the book gave me insight into my family’s past and made me feel proud of my family.  For this reason among many other I have been wanting to share the contents of this book with family and friends.  Fortunately for me I had the pleasure of meeting the book author some years ago at a family event where I asked him if I could share the book’s contents via the Internet; and he said yes.</p><p>A couple of days ago a printed version of the book was given to me (on loan) and I’m in the process of converting it into a web publication in HTML format.  Today I’m making the first part (about 10% of the book) available here:</p><p><a href='http://gaxiola.info/maclovio' target='_blank'>http://gaxiola.info/maclovio</a></p><p>The book is in Spanish but it can easily be converted to almost any language using the translation engine of Bing or Google.</p><p><a href='http://www.bing.com/translator/' target='_blank'>http://www.bing.com/translator/</a></p><p><a href='https://translate.google.com/' target='_blank'>https://translate.google.com/</a></p><p>I have endeavored to make the HTML markup as light as possible so that you can read it in your eReader tablet of choice and/or even on your cell phone.</p><p>Enjoy,</p>",
    "Type": "Personal",
    "Date": "August 10 2014",
    "ImageURL": "./images/6.png"
  },
  {
    "Id": 7,
    "Title": "Otra Obra Empezada",
    "Summary": "Hace mucho tiempo – más de 30 años – me encontré un pequeño libro escrito por un miembro de la familia Gaxiola. El título del libro es “Mi Tío Maclovio” por J. Felipe Gaxiola.  Y es una biografía de Maclovio Gaxiola López, quien era hermano de mi abuelo y un gran hombre que inspiró a muchos y cuyo legado vive.",
    "Post": "<p>Hace mucho tiempo – más de 30 años – me encontré un pequeño libro escrito por un miembro de la familia Gaxiola. El título del libro es “Mi Tío Maclovio” por J. Felipe Gaxiola.  Y es una biografía de Maclovio Gaxiola López, quien era hermano de mi abuelo y un gran hombre que inspiró a muchos y cuyo legado vive.</p><p>La lectura del libro me dio una visión del pasado de mi familia y me hizo sentir orgulloso de ella. Por esta razón, entre muchas otras, he querido compartir el contenido de este libro con familia y amigos. Afortunadamente para mí, tuve el placer de conocer al autor del libro hace algunos años en un evento familiar donde le pregunté si podía compartir el contenido del libro a través del Internet; y él me contesto que sí podía.</p><p>Hace un par de días un primo (nieto de Maclovio Gaxiola) me prestó una copia del libro y estoy en el proceso de convertirlo en una publicación web en formato de HTML. Hoy estoy compartiendo la primera parte (cerca del 10% del libro) aquí:</p><p><a href='http://gaxiola.info/maclovio' target='_blank'>http://gaxiola.info/maclovio</a></p><p>El libro está en español, pero se puede convertir fácilmente en casi cualquier idioma usando el motor de traducción de Bing o Google.</p><p><a href='http://www.bing.com/translator/' target='_blank'>http://www.bing.com/translator/</a></p><p><a href='https://translate.google.com/' target='_blank'>https://translate.google.com/</a></p><p>Me he esforzado para hacer el contenido lo más ligero posible para que se pueda leer en tableta e incluso se puede leer en teléfono moderno.</p><p>Espero les guste,</p>",
    "Type": "Personal Spanish",
    "Date": "August 10 2014",
    "ImageURL": "./images/6.png"
  },
  {
    "Id": 8,
    "Title": "Web API and CORS",
    "Summary": "Recently I added a Web API project to an existing Visual Studio MVC solution.  It all went pretty smooth and everything worked as expected all the way to deploying to the DEV webserver environment.  What happened was that the RESTfull APIs became inaccessible from my workstation’s MVC project and I had no clue as to the reason why.  After some research it all became pretty clear to me; and it has to do with CORS.",
    "Post": "<p>Recently I added a Web API project to an existing Visual Studio MVC solution.  It all went pretty smooth and everything worked as expected all the way to deploying to the DEV webserver environment.  What happened was that the RESTfull APIs became inaccessible from my workstation’s MVC project and I had no clue as to the reason why.  After some research it all became pretty clear to me; and it has to do with CORS.  If you haven’t heard about CORS, here is the definition in Wikipedia:</p><p>''Cross-origin resource sharing (CORS) is a mechanism that allows many resources (e.g., fonts, JavaScript, etc.) on a web page to be requested from another domain outside the domain the resource originated from.''</p><p>Here is what I had to do in order to make the Web API services available. It turns out that there is a NuGet package that install everything you need. After installing the package I updated the WebApiConfig class located inside the App_Start folder.   I added the System.Web.Http.Cors and the System.Net.Http.Headers namespaces to my  “using” section:</p><p>''using System.Web.Http;<br/>using System.Web.Http.Cors;<br/>using System.Net.Http.Headers;''</p><p>I then added the following lines of code to the Register class:</p><p>var attr = new EnableCorsAttribute('*', '*', 'GET');<br/>config.EnableCors(attr);<br/>config.Formatters.JsonFormatter.SupportedMediaTypes.Add(new MediaTypeHeaderValue('text/html'));</p><p>And, after building and redeploying everything worked as I had originally expected:</p><p>like magic.</p>",
    "Type": "ASP.NET",
    "Date": "August 9 2014",
    "ImageURL": "./images/8.png"
  },
  {
    "Id": 9,
    "Title": "Getting to Know AngularJS",
    "Summary": "A while back I was introduced to AngularJS while reading Dan Wahlin’s blog post: AngularJS Fundamentals in 60ish Minutes.  When I watched the embedded video I was impressed with what I saw and decided to follow along and replicate what I was watching.  This exercised worked pretty good until I came across the section regarding routing – I wasn’t able to get it to work.  Soon afterwards my interest was diverted to other things but the seed had been planted.",
    "Post": "<p>A while back I was introduced to AngularJS while reading Dan Wahlin’s blog post: AngularJS Fundamentals in 60ish Minutes.  When I watched the embedded video I was impressed with what I saw and decided to follow along and replicate what I was watching.  This exercised worked pretty good until I came across the section regarding routing – I wasn’t able to get it to work.  Soon afterwards my interest was diverted to other things but the seed had been planted.</p><p>Fast forward to June of this year (2014).  I have been reading and watching training material (mostly for beginners) going on one month and I’m convinced that AngularJS is for me.  And if you are a front-end developer: AngularJS is for you also.</p><p>Don’t let another day go by without getting familiar with AngularJS.  I repeat: do not let another day go by without looking into AngularJS.  There are many online resources.  Allow me to recommend a few:</p><p><a href='https://egghead.io/technologies/angularjs?order=ASC' target='_blank'>https://egghead.io/technologies/angularjs?order=ASC</a></p><p><a href='http://codecondo.com/3-free-books-for-learning-angularjs/' target='_blank'>http://codecondo.com/3-free-books-for-learning-angularjs/</a></p><p><a href='http://campus.codeschool.com/courses/shaping-up-with-angular-js/intro' target='_blank'>http://campus.codeschool.com/courses/shaping-up-with-angular-js/intro</a></p><p><a href='http://pluralsight.com/training/Courses/TableOfContents/angularjs-get-started' target='_blank'>http://pluralsight.com/training/Courses/TableOfContents/angularjs-get-started</a></p><p>More information and resources:</p><p><a href='https://github.com/jmcunningham/AngularJS-Learning' target='_blank'>https://github.com/jmcunningham/AngularJS-Learning</a></p><p><a href='https://angularjs.org/' target='_blank'>https://angularjs.org/</a></p><p><a href='https://builtwith.angularjs.org/' target='_blank'>https://builtwith.angularjs.org/</a></p><p>Start today.</p><p>You can thank me later…</p>",
    "Type": "Technical",
    "Date": "July 21 2014",
    "ImageURL": "./images/9.png"
  },
  {
    "Id": 10,
    "Title": "Updating The Gaxiola Website",
    "Summary": "It’s been a while (more than 15 years) since I registered the domain name familiagaxiola.com and created a website for the Gaxiola surname. A couple of years later the domain name gaxiolafamily.com became available and I immediately added it to my account. The website has been going through stages and changes ever since inception. Sometimes the process has to do with me, sometimes it has to do with technology, and sometimes is time and resources, but most of the time it’s just life getting in the way of progress – or maybe progress getting in the way of life",
    "Post": "<p>It’s been a while (more than 15 years) since I registered the domain name familiagaxiola.com and created a website for the Gaxiola surname. A couple of years later the domain name gaxiolafamily.com became available and I immediately added it to my account. The website has been going through stages and changes ever since inception. Sometimes the process has to do with me, sometimes it has to do with technology, and sometimes is time and resources, but most of the time it’s just life getting in the way of progress – or maybe progress getting in the way of life; I’m never sure what gets in the way of what. But, the fact of the matter is that this website is never, ever, going to be completed to my satisfaction.</p><p>Nevertheless, this time I’m making the following commitment: The website will meet the following requirements before the end of the year:<br/>The website is to be a central hub for the Gaxiola surname<br/>With five sections: Reunions, Blogs, News, Business, Pictures, Social Media, and Memoriam.<br/>The site is to be responsive, fluid, and fast.</p><p>Short and simple. Something that can actually be accomplished this year if life allows it. And something that I would like to accomplish with some help from family and friends.</p><p>For this reason I have created the following Trello board (link at the bottom of this post) so that anybody that wants to help can help by adding their voice to the process, and by guiding me in the right direction. You want to help with development? Go to <a href='https://github.com/abelgaxiola/gaxiola' target='_blank'>https://github.com/abelgaxiola/gaxiola</a> and issue a pull request. You can also follow @familiagaxiola on Twitter and Facebook. And this should go without saying: the best way that anyone can help is by providing positive feedback.</p><p>Public Trello board: (no longer available)</p>",
    "Type": "Personal",
    "Date": "June 5 2014",
    "ImageURL": "./images/10.png"
  },
  {
    "Id": 11,
    "Title": "Staying Up-To-Date Is Hard Work (But Fun)",
    "Summary": "I was watching an online training video yesterday and found myself agreeing with everything that the presenter was saying.  The online video is provided by Pluralsight and the name of the course is 'JavaScript the Good Parts'' presented by Douglas Crockford.  Mr. Crockford makes it clear, at least to me, that writing software is hard work; and I couldn't agree more.",
    "Post": "<p>I was watching an online training video yesterday and found myself agreeing with everything that the presenter was saying.  The online video is provided by Pluralsight and the name of the course is 'JavaScript the Good Parts' presented by Douglas Crockford.  Mr. Crockford makes it clear, at least to me, that writing software is hard work; and I couldn't agree more.</p><p>Recently I been trying to update my skills to include modern web and mobile development.  Now, I say modern web because I've been doing web development for years but never fully understanding and applying the separation of concerns that are provided with HTML5, CSS3, and JavaScript.  And, not until recently have I been concerned with my websites being responsive.</p><p>Getting up to speed with the newest incarnation of these technologies and methodologies is taking me longer than anticipated, and it definitely takes work and effort to get it right.  But the satisfaction of getting it right once in a while or solving a problem makes it all worth the effort.</p><p>So how does 'Hard Work' === 'Fun'?  The only way that I can explain it is by comparing it to the joy of ridding a bicycle 60 miles without stopping (something I do once a year at a family event): it's hard and painful but at the end the feeling of accomplishment makes it all worth the while.</p>",
    "Type": "Opinion",
    "Date": "March 5 2014",
    "ImageURL": "./images/11.png"
  },
  {
    "Id": 12,
    "Title": "Getting To Know Twitter (Again)",
    "Summary": "I created a Twitter account on January 2010 and have to admit that I did not think much about the platform and thought even less about the fact that my posts have a 140 character restriction.  This year I decided to take a second look and see if I’m missing anything by mostly ignoring the platform.  So what better way to get familiar with something but by using it and by doing some research.  And here is a summary of what I have found:",
    "Post": "<p>I created a Twitter account on January 2010 and have to admit that I did not think much about the platform and thought even less about the fact that my posts have a 140 character restriction.  This year I decided to take a second look and see if I’m missing anything by mostly ignoring the platform.  So what better way to get familiar with something but by using it and by doing some research.  And here is a summary of what I have found:</p><p>Twitter is used by most major broadcasting companies in the world.  Those include television, cable, radio, news, etc.  The government and most of the politicians in the US have Twitter accounts.  Twitter has been instrumental in most of the recent popular movements, and it has become one of the preferred methods to disseminate information to members of the movement and to the world.  I don’t have the actual facts about this one but I’ll go out on a limb and say that most major corporations have Twitter accounts.  And without a doubt most public figures such as actors, singers, reporters, and the like, have accounts – some to their detriment.  Maybe all of these facts are obvious to most but I never really cared or paid any attention to it.</p><p>So why am I talking about it today?  Because of something that happened in the last 24 hours: I posted a comment on Twitter that was retweeted to more than 103,900 twitter members, and it was favorited by six people that have a combined total of more than 700 followers.  So what does this mean?  It means that there is huge potential in the possibility of reaching beyond our inner circles.  And if that means anything to you, then you should consider getting to know Twitter.</p><p>If you do create a Twitter account don’t forget to ad @abelgaxiola and @familiagaxiola to your Following list.</p>",
    "Type": "Opinion",
    "Date": "February 5 2014",
    "ImageURL": "./images/12.png"
  },
  {
    "Id": 13,
    "Title": "Small Things That Make a Difference",
    "Summary": "For years now my wife has made it a point to include small notes with my lunch. She does this randomly and I never know when I’ll be opening my lunch box and find one of these notes. The stationary she uses is nothing special, just a regular piece of paper or one of those Post-It notes. She handwrites the message and writes wishing me good luck or thanking me for something, and most of the time she will end the message saying that she loves me.",
    "Post": "<p>For years now my wife has made it a point to include small notes with my lunch. She does this randomly and I never know when I’ll be opening my lunch box and find one of these notes. The stationary she uses is nothing special, just a regular piece of paper or one of those Post-It notes. She handwrites the message and writes wishing me good luck or thanking me for something, and most of the time she will end the message saying that she loves me.</p><p>The point is that I’m always surprised when I find one of the notes and it always turns my day into a better day and make me feel really good about myself and my relationship with my wife. I don’t know if I can say the same about myself. I hope that some of the things I do are also received by her in the same manner – I just don’t know.</p><p>I do know this: those little notes in my lunch box sure make me feel good.</p>",
    "Type": "Family",
    "Date": "January 29 2014",
    "ImageURL": "./images/13.png"
  },
  {
    "Id": 14,
    "Title": "Sharing Photos (a few words of advice)",
    "Summary": "I created a Flickr account a few of months ago when it was announced that Flickr was providing one free terabyte of storage – not that I’ll ever use up the storage but it’s nice not to worry. In the past I used a couple of other image/photo sharing sites such as Google’s Picasa and another that I can’t even remember the name.",
    "Post": "<p>I created a Flickr account a few of months ago when it was announced that Flickr was providing one free terabyte of storage – not that I’ll ever use up the storage but it’s nice not to worry. In the past I used a couple of other image/photo sharing sites such as Google’s Picasa and another that I can’t even remember the name. I also use Facebook, DropBox, and Windows Live accounts for photo sharing but they are not in the same league or category of sites whose primary line of business is storing photos and images.</p><p>Recently, in the last couple of weeks, I have been uploading some of my photos to my Flickr account and have to admit that even though the learning process has not been without frustration I’m mostly happy and highly recommend Flickr. Now, the service is not perfect, and the web interface is not intuitive, but things can be figured out; and once you figure it out is pretty much a walk in the park from there on.</p><p>If you are thinking about using Flickr for your photos here are a few words of advice:</p><p><strong>If you are thinking about using Flickr for your photos here are a few words of advice:</strong></p><p>Always create a set with the pictures you upload as soon as you upload them. Why? Because it makes it a lot easier to select the pictures you want to include in your set by simply selecting (filtering) all the pictures in your photostream that are not in a set. (Photostream is the section where all the photos belonging to your account are displayed).</p><p>Give your photos a name before you upload them. Most cameras give the photos names such as GWS234568 or something similar that mean very little to us humans. I rename all my photos using the name of the occasion, the date, or both.</p><p>Keep track of those photos you have uploaded by either moving them into a separate folder or just by making a note of which was the last photo that was uploaded (assuming they are in some type of order). Do this so that you don’t have to deal with the frustration of figuring out which set of photos you were uploading when the computer froze or the connection timed out, etc.</p><p>Organize your photos in collections. Collections can contain other collections and also sets – analogous to folder structures in the file directory of the computer.</p><p>Limit sets to no more than 200 photos if you can. I initially created a set with 400+ photos and I noticed that this particular set would take longer to load than the other smaller sets.</p><p>Organize you collections and sets by clicking on the ellipsis (three dots) in the right hand side of your account page, selecting the Organize option, then selecting the (Sets & Collections) tab. Maybe it’s just me, but it took me time to figure out how to access this option.</p><p>I guess I can keep on going but I’ll finish by sharing my photos so you can get an idea of what I’m talking about.</p><p><a href='http://www.flickr.com/photos/abelgaxiola/' target='_blank'>http://www.flickr.com/photos/abelgaxiola/</a></p>",
    "Type": "Personal",
    "Date": "September 14 2013",
    "ImageURL": "./images/14.png"
  },
  {
    "Id": 15,
    "Title": "El Tour de Kino 2012",
    "Summary": "Came and is now a memory in our minds and in our hearts. This year we got together like always: to enjoy some quality time with our family and friends. And also to honor a pillar of our great and beautiful family: Jesus Miguel Encinas Gaxiola (el Palle). The family reunion got started on Friday May 25th where members of the Encinas Gaxiola clan provided food and entertainment for all present. The food was great and the fellowship was even better; once again our family bonds were strengthened by the love and kindness of all present.",
    "Post": "<p>Came and is now a memory in our minds and in our hearts. This year we got together like always: to enjoy some quality time with our family and friends. And also to honor a pillar of our great and beautiful family: Jesus Miguel Encinas Gaxiola (el Palle). The family reunion got started on Friday May 25th where members of the Encinas Gaxiola clan provided food and entertainment for all present. The food was great and the fellowship was even better; once again our family bonds were strengthened by the love and kindness of all present.</p><p>The next day we met at one of the local cemeteries where my grandparents, mother, and other family members are resting. This also has become a tradition and is now the starting place for the 100 km bicycle ride to Kino Bay. And so the Tour portion of the reunion got started. Not too many riders this year – eight in total – but the spirit to participate and compete was there. A little over three and a half hours later with only 200 meters remaining there was a sprint to the finish line and thanks to Jeff Farmer, Pancho Cuamea, and a good pair of legs I finished in first place.</p><p>The entire day was a success. We had live music playing, plenty to eat and drink, and above all lots of love and kindness. We were all hoping that our beloved Palle would be able to make it to the reunion this year but unfortunately he was not feeling well and was not able to make it. Trophies were awarded to the first three places and a plaque recognizing Palle’s many years sponsoring and coordinating the family event was awarded to those members of his family that were present.</p><p>Sunday was a repeat: more live music, food and drink, and… plenty of love and kindness. Sunday is also the day when many have to leave and return to their homes. I know that many of those I said goodbye to I will not see again until next year – maybe and maybe not. I’m just glad I was able to see them and spend some time with them in fellowship this year</p><p>There are pictures and videos on-line. Just search for 'Familia Gaxiola' or 'Gaxiola Family' using your favorite search engine.</p>",
    "Type": "Family",
    "Date": "June 10 2012",
    "ImageURL": "./images/15.png"
  },
  {
    "Id": 16,
    "Title": "Getting Started with AppHarbor via BitBucket",
    "Summary": "A while back I heard a podcast having to do with cloud technology and platform as a service provided by AppHarbor.  At that time I didn’t pay much attention past the fact that it was an interesting conversation regarding a technology that I keep under the radar ever since I attended a talk regarding Amazon’s cloud offerings.  Last time I did anything having to do with similar technology was when MS was promoting Azure by offering limited free accounts.  I remember being very excited and quickly signing up for my free account.",
    "Post": "<p>A while back I heard a podcast having to do with cloud technology and platform as a service provided by AppHarbor.  At that time I didn’t pay much attention past the fact that it was an interesting conversation regarding a technology that I keep under the radar ever since I attended a talk regarding Amazon’s cloud offerings.  Last time I did anything having to do with similar technology was when MS was promoting Azure by offering limited free accounts.  I remember being very excited and quickly signing up for my free account.  Azure was fun and I did learn some new concepts but was never able to justify converting my free account to a pay account – at least not for my personal consumption.</p><p>Well, I don’t have to justify anything anymore.  AppHarbor’s website greets you with the following words: Azure done right.  And after spending some hours working with it I have to conclude that this is indeed the truth.  Disclaimer: I haven’t revisited Azure recently but the last time I checked it was still not free (there is a free 90 days trial but you need a credit card to create the account – you can guess what happens after the 90 days).</p><p>If you are a .NET developer and are looking to leverage the power and flexibility of cloud computing allow me to suggest you take a look at AppHarbor and what it has to offer.  Here is my short list of what impressed me the most about AppHarbor.<br/>Extremely fast deployment of .NET solutions.<br/>Integrates with BitBucket in a seamless manner<br/>Free application hosting<br/>Free SQL Server DB (20 MB</p><p>I have to admit that deploying my first app to the cloud via AppHarbor was not as easy as some articles make it to be, but after I was able to resolve my issues the simplicity of deploying became clear.  I have a new perspective regarding the tools and the deployment cycle; from using TortoiseHg, to versioning in the cloud (BitBucket), and automatically deploying to AppHarbor.  The fruits of my labor are nothing to brag about but the learning experience was priceless.</p><p>My advice: don't wait another day and take a look at the cloud solution today.</p>",
    "Type": "Technical",
    "Date": "November 12 2011",
    "ImageURL": "./images/16.png"
  },
  {
    "Id": 17,
    "Title": "Trello Anyone?",
    "Summary": "Came across this web app about a week ago while reading one of those online technical news websites and decided to give it a try.  And I have to admit that I’m impressed.  First of all I’m impressed with the technology behind the product and I’m amazed at how it works.  Second, I’m impressed because of the simplicity and ease of use: no need to read an instruction manual – I don’t even know if there is one – and no digging around hundreds of options and functionalities trying to figure out which is what and why I need it.",
    "Post": "<p>Came across this web app about a week ago while reading one of those online technical news websites and decided to give it a try.  And I have to admit that I’m impressed.  First of all I’m impressed with the technology behind the product and I’m amazed at how it works.  Second, I’m impressed because of the simplicity and ease of use: no need to read an instruction manual – I don’t even know if there is one – and no digging around hundreds of options and functionalities trying to figure out which is what and why I need it.</p><p>I started using Trello at work to manage my tasks and now I’m using it to manage my personal tasks.  Currently I’m using this web app pretty much as a to-do list but it can be much, much more.  In its most simple form Trello is nothing more than a board area with lists of cards.  Here is a screenshot of my Personal board (one board, three lists, with each list hosting two or more cards):</p><p>Cards can be moved between boards by simple drag-and-drop.  Cards also have plenty of room for notes, attachments, lists, and other options which I’m not going to get into at this time.  Here is a screenshot of one of my cards:</p><p>Want to learn more about it?  I recommend watching the video: <a href='https://youtu.be/aaDf1RqeLfo' target='_blank'>https://youtu.be/aaDf1RqeLfo</a></p><p>And if you want to learn more read the following posts:</p><p><a href='http://blog.trello.com/launch/' target='_blank'>http://blog.trello.com/launch/</a></p>",
    "Type": "Opinion",
    "Date": "September 21 2011",
    "ImageURL": "./images/17.png"
  },
  {
    "Id": 18,
    "Title": "No More Cable TV",
    "Summary": "For months, I have been thinking about canceling my television cable subscription.  Now, I finally did it and I couldn’t be happier about it.  I have nothing against cable companies.  They offer a service for a fee that for the most part is affordable and convenient – for most people; not for me.  My reason for wanting to get rid of cable TV was twofold: I wanted to cut down on watching TV, and couldn’t justify the cost benefit ratio.",
    "Post": "<p>For months, I have been thinking about canceling my television cable subscription.  Now, I finally did it and I couldn’t be happier about it.  I have nothing against cable companies.  They offer a service for a fee that for the most part is affordable and convenient – for most people; not for me.  My reason for wanting to get rid of cable TV was twofold: I wanted to cut down on watching TV, and couldn’t justify the cost benefit ratio.</p><p>I’m a news junkie – mostly political news – and can spend hours a day watching nothing but news channels such as Fox, CNN, and PBS – and the Sunday News/Political commentary shows on the alphabet channels (ABC, NBC, and CBS).  And for the most part that was all I ever watched on a regular basis; nothing else.  No movies, no TV programs – well, maybe a Seinfeld rerun once in a while – no sports, nothing.  So, in my mind paying $70.00 a month for basic cable subscription to watch news over and over, news that I could probably read on the internet was not worth it and was wasting my time.</p><p>Now I have a device called Roku (http://www.roku.com ).  No more paying for 100+ channels I’m not interested in.  Currently I only pay $8.00 a month for a Netflix subscription that streams movies and other videos via my Roku.  I justify this monthly subscription because I was spending that much renting $1.00 movies at Red Box kiosks and other places.  Now I have lot’s more to choose from and I don’t pay late fees.  I also use Roku to stream music via Pandora, and use it to watch free technology channels such as TWiT.tv, YUI Theater, CNET, and more.</p><p>Before I decided to go with Roku I did some research and found that there are many similar devices.  After spending many hours comparing features and reading reviews I decided to go ahead and spend $99.99 for the high end version – and I’m glad I did.  This device was the only one that supported the 1080p HD quality via an HDMI cable, and had a USB port.  That was two months ago.  Today there are newer versions called ROKU 2 with more features and for the same prices.  The most expensive device is still $99.99 but it now includes a free full edition of Angry Birds and it has an Ethernet port.  Now you can get one that supports the 1080p HD for $79.99.  Maybe I’ll buy a new one for the bedroom.</p><p>In summary: I’m not watching as much news and political commentaries as before – a good thing.  And I’m not spending $70.00 a month on cable TV.  I really miss FOX and CNN, but now I get to spend more time doing other things such as reading, working on my websites, and blogging.  Now, if I could just stop playing Angry Birds….</p>",
    "Type": "Opinion",
    "Date": "August 20 2011",
    "ImageURL": "./images/18.png"
  }
]
